package Lessons.Lesson3;

public class Operators {
    public static void main(String[] args) {

        /*
        Short circuit (&& and, || or ) and bitwise operators (& , |)

        Short circuit - не всегда все операнды этого оператора выполняются, т.е.
        если в выражении сравнения, уже на первом этапе есть значение false, т.к. ответ
        очевиден, то проверка останавливается не проходя на следующий этап..

        bitwise operators - выполняются всегда, независимо от результата значений операндов.
        Могут работать с числами, в то время как Short circuit операторы не могут.

        POSTFIX (y++) and PREFIX (++y) operators
        ++y / увеличить значение на 1 и использовать новое значение...
        у++ / использовать старое значение, затем только увеличить "у" не используя новое
        значение

         */
    }
}
